nullstalgia/lufarduino/lufarduino/avr/boards.txt
# See: http://code.google.com/p/arduino/wiki/Platforms

menu.cpu=Processor

menu.bootloader=Bootloader

menu.optimization=Olevel

##############################################################


##############################################################
#
lufamicro.name=32u4 
lufamicro.vid.0=0x0F0D
lufamicro.pid.0=0x0092
lufamicro.vid.1=0x1209
lufamicro.pid.1=0x2231
lufamicro.vid.2=0x1208
lufamicro.pid.2=0x2238
 
lufamicro.menu.bootloader.dfu=DFU
lufamicro.menu.bootloader.dfu.upload.tool=dfu-programmer
lufamicro.menu.bootloader.dfu.upload.protocol=dfu
lufamicro.menu.bootloader.dfu.upload.maximum_size=28672
lufamicro.menu.bootloader.dfu.upload.maximum_data_size=2560
lufamicro.menu.bootloader.dfu.upload.speed=57600
lufamicro.menu.bootloader.dfu.upload.disable_flushing=true
lufamicro.menu.bootloader.dfu.upload.use_1200bps_touch=false                                  
lufamicro.menu.bootloader.dfu.upload.wait_for_upload_port=false
lufamicro.menu.bootloader.dfu.bootloader.file=32u4/DFU.hex

lufamicro.menu.bootloader.caterina=Caterina
lufamicro.menu.bootloader.caterina.upload.tool=avrdude
lufamicro.menu.bootloader.caterina.upload.protocol=avr109
lufamicro.menu.bootloader.caterina.upload.maximum_size=28672
lufamicro.menu.bootloader.caterina.upload.maximum_data_size=2560
lufamicro.menu.bootloader.caterina.upload.speed=57600
lufamicro.menu.bootloader.caterina.upload.disable_flushing=true
lufamicro.menu.bootloader.caterina.upload.use_1200bps_touch=true
lufamicro.menu.bootloader.caterina.upload.wait_for_upload_port=true
lufamicro.menu.bootloader.caterina.bootloader.file=32u4/Caterina.hex

lufamicro.bootloader.tool=avrdude
lufamicro.bootloader.low_fuses=0xff
lufamicro.bootloader.high_fuses=0xd8
lufamicro.bootloader.extended_fuses=0xcb
lufamicro.bootloader.unlock_bits=0x3F
lufamicro.bootloader.lock_bits=0x2F

lufamicro.build.mcu=atmega32u4
lufamicro.build.f_cpu=16000000L
lufamicro.build.vid=0x2341
lufamicro.build.pid=0x8037
lufamicro.build.usb_product="Micro"
lufamicro.build.board=AVR_MICRO
lufamicro.build.core=arduino
lufamicro.build.variant=micro

lufamicro.menu.optimization.size=Size
lufamicro.menu.optimization.size.build.extra_flags={build.usb_flags} -DSerial=Serial1 -Os
lufamicro.menu.optimization.balance=Balance
lufamicro.menu.optimization.balance.build.extra_flags={build.usb_flags} -DSerial=Serial1 -O2
lufamicro.menu.optimization.speed=Speed
lufamicro.menu.optimization.speed.build.extra_flags={build.usb_flags} -DSerial=Serial1 -O3
lufamicro.build.extra_flags={build.usb_flags} -DSerial=Serial1 


##############################################################

lufamicroled.name=32u4 (Leonardo LEDs)

lufamicroled.upload.tool=avrdude
lufamicroled.upload.protocol=avr109
lufamicroled.upload.maximum_size=28672
lufamicroled.upload.maximum_data_size=2560
lufamicroled.upload.speed=57600
lufamicroled.upload.disable_flushing=true
lufamicroled.upload.use_1200bps_touch=true
lufamicroled.upload.wait_for_upload_port=true

lufamicroled.menu.bootloader.dfu=DFU
lufamicroled.menu.bootloader.dfu.upload.tool=dfu-programmer
lufamicroled.menu.bootloader.dfu.upload.protocol=dfu
lufamicroled.menu.bootloader.dfu.upload.maximum_size=28672
lufamicroled.menu.bootloader.dfu.upload.maximum_data_size=2560
lufamicroled.menu.bootloader.dfu.upload.speed=57600
lufamicroled.menu.bootloader.dfu.upload.disable_flushing=true
lufamicroled.menu.bootloader.dfu.upload.use_1200bps_touch=false
lufamicroled.menu.bootloader.dfu.upload.wait_for_upload_port=false
lufamicroled.menu.bootloader.dfu.bootloader.file=32u4/DFU.hex

lufamicroled.menu.bootloader.caterina=Caterina
lufamicroled.menu.bootloader.caterina.upload.tool=avrdude
lufamicroled.menu.bootloader.caterina.upload.protocol=avr109
lufamicroled.menu.bootloader.caterina.upload.maximum_size=28672
lufamicroled.menu.bootloader.caterina.upload.maximum_data_size=2560
lufamicroled.menu.bootloader.caterina.upload.speed=57600
lufamicroled.menu.bootloader.caterina.upload.disable_flushing=true
lufamicroled.menu.bootloader.caterina.upload.use_1200bps_touch=true
lufamicroled.menu.bootloader.caterina.upload.wait_for_upload_port=true
lufamicroled.menu.bootloader.caterina.bootloader.file=32u4/Caterina.hex

lufamicroled.bootloader.tool=avrdude
lufamicroled.bootloader.low_fuses=0xff
lufamicroled.bootloader.high_fuses=0xd8
lufamicroled.bootloader.extended_fuses=0xcb
lufamicroled.bootloader.unlock_bits=0x3F
lufamicroled.bootloader.lock_bits=0x2F

lufamicroled.build.mcu=atmega32u4
lufamicroled.build.f_cpu=16000000L
lufamicroled.build.vid=0x2341
lufamicroled.build.pid=0x8037
lufamicroled.build.usb_product="Micro"
lufamicroled.build.board=AVR_MICRO
lufamicroled.build.core=arduino
lufamicroled.build.variant=leonardo
lufamicroled.build.extra_flags={build.usb_flags} -DSerial=Serial1

##############################################################

##############################################################

supermicro.name=16u2 (SuperMicro)

supermicro.upload.tool=avrdude
supermicro.upload.protocol=avr109
supermicro.upload.maximum_size=28672
supermicro.upload.maximum_data_size=2560
supermicro.upload.speed=57600
supermicro.upload.disable_flushing=true
supermicro.upload.use_1200bps_touch=true
supermicro.upload.wait_for_upload_port=true

supermicro.bootloader.tool=avrdude
supermicro.bootloader.low_fuses=0xEF
supermicro.bootloader.high_fuses=0xD9
supermicro.bootloader.extended_fuses=0xFC
supermicro.bootloader.unlock_bits=0x3F
supermicro.bootloader.lock_bits=0x2F

supermicro.menu.bootloader.dfu=DFU
supermicro.menu.bootloader.dfu.upload.tool=dfu-programmer
supermicro.menu.bootloader.dfu.upload.protocol=dfu
supermicro.menu.bootloader.dfu.upload.maximum_size=28672
supermicro.menu.bootloader.dfu.upload.maximum_data_size=2560
supermicro.menu.bootloader.dfu.upload.speed=57600
supermicro.menu.bootloader.dfu.upload.disable_flushing=true
supermicro.menu.bootloader.dfu.upload.use_1200bps_touch=false
supermicro.menu.bootloader.dfu.upload.wait_for_upload_port=false
supermicro.menu.bootloader.dfu.bootloader.file=16u2/DFU.hex

supermicro.menu.bootloader.caterina=Caterina
supermicro.menu.bootloader.caterina.upload.tool=avrdude
supermicro.menu.bootloader.caterina.upload.protocol=avr109
supermicro.menu.bootloader.caterina.upload.maximum_size=28672
supermicro.menu.bootloader.caterina.upload.maximum_data_size=2560
supermicro.menu.bootloader.caterina.upload.speed=57600
supermicro.menu.bootloader.caterina.upload.disable_flushing=true
supermicro.menu.bootloader.caterina.upload.use_1200bps_touch=true
supermicro.menu.bootloader.caterina.upload.wait_for_upload_port=true
supermicro.menu.bootloader.caterina.bootloader.file=16u2/Caterina.hex

supermicro.build.mcu=atmega16u2
supermicro.build.f_cpu=16000000L
supermicro.build.vid=0x2341
supermicro.build.pid=0x8037
supermicro.build.usb_product="SuperMicro"
supermicro.build.board=AVR_MICRO
supermicro.build.core=arduino
supermicro.build.variant=supermicro
supermicro.build.extra_flags={build.usb_flags} -DSerial=Serial1

##############################################################

